spec/cassettes/StripeWrapper/StripeWrapper_Customer/_create/creates_a_new_customer_with_valid_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242%204242%204242%204242&card[exp_month]=11&card[exp_year]=2016&card[cvc]=314
    headers:
      Accept:
      - ! '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.8
      Authorization:
      - Bearer sk_test_0GZIa56QpRrqbGHqREQCYYf5
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.8.8","lang":"ruby","lang_version":"1.9.3 p194 (2012-04-20)","platform":"x86_64-darwin10.8.0","publisher":"stripe","uname":"Darwin
        pauls-macbook-pro.local 10.8.0 Darwin Kernel Version 10.8.0: Tue Jun  7 16:33:36
        PDT 2011; root:xnu-1504.15.3~1/RELEASE_I386 i386"}'
      Content-Length:
      - '91'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 08 Dec 2013 03:42:17 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '571'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: US-ASCII
      string: ! "{\n  \"id\": \"tok_10358j2EgJ8VpLXrCe7ipSeD\",\n  \"livemode\": false,\n
        \ \"created\": 1386474137,\n  \"used\": false,\n  \"object\": \"token\",\n
        \ \"type\": \"card\",\n  \"card\": {\n    \"id\": \"card_10358j2EgJ8VpLXrIAAuumhX\",\n
        \   \"object\": \"card\",\n    \"last4\": \"4242\",\n    \"type\": \"Visa\",\n
        \   \"exp_month\": 11,\n    \"exp_year\": 2016,\n    \"fingerprint\": \"NjRZljRJ10zh6goe\",\n
        \   \"customer\": null,\n    \"country\": \"US\",\n    \"name\": null,\n    \"address_line1\":
        null,\n    \"address_line2\": null,\n    \"address_city\": null,\n    \"address_state\":
        null,\n    \"address_zip\": null,\n    \"address_country\": null\n  }\n}\n"
    http_version: 
  recorded_at: Sun, 08 Dec 2013 03:42:17 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: plan=Basic&card=tok_10358j2EgJ8VpLXrCe7ipSeD&email=jee.lynch%40franecki.name
    headers:
      Accept:
      - ! '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.8
      Authorization:
      - Bearer sk_test_0GZIa56QpRrqbGHqREQCYYf5
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.8.8","lang":"ruby","lang_version":"1.9.3 p194 (2012-04-20)","platform":"x86_64-darwin10.8.0","publisher":"stripe","uname":"Darwin
        pauls-macbook-pro.local 10.8.0 Darwin Kernel Version 10.8.0: Tue Jun  7 16:33:36
        PDT 2011; root:xnu-1504.15.3~1/RELEASE_I386 i386"}'
      Content-Length:
      - '76'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 08 Dec 2013 03:42:22 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1764'
      Connection:
      - keep-alive
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: US-ASCII
      string: ! "{\n  \"object\": \"customer\",\n  \"created\": 1386474138,\n  \"id\":
        \"cus_358jMCNSYZy9Op\",\n  \"livemode\": false,\n  \"description\": null,\n
        \ \"email\": \"jee.lynch@franecki.name\",\n  \"delinquent\": false,\n  \"metadata\":
        {},\n  \"subscription\": {\n    \"id\": \"sub_358jzOniJPZQCh\",\n    \"plan\":
        {\n      \"interval\": \"month\",\n      \"name\": \"Basic Monthly Plan\",\n
        \     \"amount\": 999,\n      \"currency\": \"usd\",\n      \"id\": \"Basic\",\n
        \     \"object\": \"plan\",\n      \"livemode\": false,\n      \"interval_count\":
        1,\n      \"trial_period_days\": 7,\n      \"metadata\": {}\n    },\n    \"object\":
        \"subscription\",\n    \"start\": 1386474138,\n    \"status\": \"trialing\",\n
        \   \"customer\": \"cus_358jMCNSYZy9Op\",\n    \"cancel_at_period_end\": false,\n
        \   \"current_period_start\": 1386474138,\n    \"current_period_end\": 1387078938,\n
        \   \"ended_at\": null,\n    \"trial_start\": 1386474138,\n    \"trial_end\":
        1387078938,\n    \"canceled_at\": null,\n    \"quantity\": 1,\n    \"application_fee_percent\":
        null\n  },\n  \"discount\": null,\n  \"account_balance\": 0,\n  \"cards\":
        {\n    \"object\": \"list\",\n    \"count\": 1,\n    \"url\": \"/v1/customers/cus_358jMCNSYZy9Op/cards\",\n
        \   \"data\": [\n      {\n        \"id\": \"card_10358j2EgJ8VpLXrIAAuumhX\",\n
        \       \"object\": \"card\",\n        \"last4\": \"4242\",\n        \"type\":
        \"Visa\",\n        \"exp_month\": 11,\n        \"exp_year\": 2016,\n        \"fingerprint\":
        \"NjRZljRJ10zh6goe\",\n        \"customer\": \"cus_358jMCNSYZy9Op\",\n        \"country\":
        \"US\",\n        \"name\": null,\n        \"address_line1\": null,\n        \"address_line2\":
        null,\n        \"address_city\": null,\n        \"address_state\": null,\n
        \       \"address_zip\": null,\n        \"address_country\": null,\n        \"cvc_check\":
        \"pass\",\n        \"address_line1_check\": null,\n        \"address_zip_check\":
        null\n      }\n    ]\n  },\n  \"default_card\": \"card_10358j2EgJ8VpLXrIAAuumhX\"\n}\n"
    http_version: 
  recorded_at: Sun, 08 Dec 2013 03:42:22 GMT
recorded_with: VCR 2.8.0
